//자바스크립트는 기본적으로 동기적 수행을 한다 => 자바스크립트는 싱글스레드 언어이다.
//한번에 하나의 작업만 수행할 수 있다.
console.log("작업 1");
console.log("작업 2");
console.log("작업 3");

console.log("작업 1");
print();
console.log("작업 3");

function print() {
	console.log("작업 2");
}

//자바스크립트는 실행전에 함수나 변수들을 미리 메모리에 올려놓습니다. 이를 호이스팅(hoisting)이라고 합니다.
//호이스팅은 변수 선언과 함수 선언을 코드의 최상단으로 끌어올리는 동작입니다.

//동기적으로 실행되는 방식의 경우는 block이라는 현상이 발생할 수 있다
//이전 작업이 완료되지 않으면 다음 작업이 수행되지 않는 현상
//예를 들어 작업 1이 서버에 데이터 요청을 보내고 받아오는 작업이라 치면 다 받아 올때까지 작업 2와 작업 3은
//이행되지 않는다

//이것이 동기식의 문제 똥기가 된다
